xml/request/getUserStatus.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openuserstatus">
   <soapenv:Header/>
   <soapenv:Body>
      <open:getUserStatusRequest>
         <open:userId>0406581055</open:userId>
         <!--Optional:-->
         <open:userPincode>1055</open:userPincode>
         <open:agencyId>DK-100450</open:agencyId>
      </open:getUserStatusRequest>
   </soapenv:Body>
</soapenv:Envelope>
