xml/request/renewLoan.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openuserstatus">
   <soapenv:Header/>
   <soapenv:Body>
      <open:renewLoanRequest>
         <open:userId>0406581055</open:userId>
         <!--Optional:-->
         <open:userPincode>1055</open:userPincode>
         <open:agencyId>DK-100450</open:agencyId>
         <!--1 or more repetitions:-->
         <open:loanId>1</open:loanId>
         <open:loanId>2</open:loanId>
         <open:loanId>3</open:loanId>
      </open:renewLoanRequest>
   </soapenv:Body>
</soapenv:Envelope>
